";" will represent stacking commands as if shell is enabled
___Basics____
int fa 1/0/1; means interface type stack-member/module/portnumber- you will usually only see modules with routers.
creating a macro for lots of configurations-
config)#define interface-range MymacroName fa 1/0/1 - 4 , fa 2/0/3 - 7, g 3/0/1 , g 3/0/2
config)#int r macro MymacroName;  book says always use spaces with hyphens and commas
___basics____
___VTP____
vtp version 3 allows vlans in the extended range to be configured 1006- 4094
vtp version 1 &2 will also allow extended vlans but only in transparent mode.
VTP advertisements:
summary advertisement- sent every 300 seconds or vlan database change. For vlan config changes subset adv will follow.
subset advertisement- created or deleted vlan, suspending or activating vlan, change in MTU, status, type,SAID security association identifier
advertisement request from client- switch reset, vlan database cleared, vtp domain change, summ adv with higher revision number
will spon advertisement requests from clients to gather vtp info- server will send summary adv, then subset adv.
Storage: server mode stores vlan and vtp in vlan.dat stored on flash memory, not with config which is in NVRAM
upon reboot a server will have all its last known vlan data and vtp.
Two ways to get revision to 0- change domain, change mode to transparent.
CLIENT SENDS ADVERTISEMENTS WHEN IT FIRST POWERS UP!!!- Upon reboot if a client has higher revision could cause catastrophe.
VTP revision number is saved in NVRAM.
show vtp status; show int fa 1/0/1 [pruning | switchport];
vtp mode [ server | client | transparent | off]
vtp password [hidden | secret]; hidden-hash is saved in run-conf. secret the password is saved in run-conf
config)#vtp pruning; enables vtp pruning on device. This will stop unneeded traffic across trunk but not spanning tree instances
config-if)# switchport trunk vlan allowed 3,4,5; manually prune traffic and stp on for these vlans
config-if)#switchport trunk pruning vlan [add | except | none | remove]; granular config of pruning, default prunes all
SW# delete vlan.dat; delete your vlan and vtp database
recall revision number is stored in NVRAM!
Two switches connected on trunk no vtp domain configured- no propogation
-----labs tests and results-----
LAb1
Sw1 server sw2 server to gain database, change sw2 to client, introduce bad update as if bad switch introduced,
take down trunk and reload- results= bad data still in switch , next erase nvram- results=same bad vlan info
Lab2
Introduce client in environment with higher revision number- results = it will override vtp server data, vtp client with
higher revision number is just as dangerous as server w/ highest revision number, wins even if client.
Lab3 erase nvram;reload; on both client and server result= all vtp and vlan information present including revision. data stored in vlan.dat
I don't care what the books say data is stored, it is in vlan.dat, only difference between clinet and server is client cannot
create vlans only server can alter. Client can not alter internal data but will destroy everyones elses if has higher revision.

___vtp____
___VTP-Version3____
Primary server- Only I can change database info. No clinets or other servers over riding with higher revision
extended vlans- 1006-4094 supported
private vlans- supported, database info but not port info
rspan- remote span will also propagate. Basically supported meaning propagate the vtp domain
mstp support-
Auth- hidden allows you to put in pass and can not view plain text only 32 hex chars
secret- allows you to put the hex pass in to enter domain
off- completely turn off as compared to 2 or 1 neeed transparent which still porpagated but did not synch.
compatibility- compatible with version 2 not 1. but as expected 2 is limited to 2s features only
show vtp devices; unlike CDP vtp is not limited to directly connected devices, vtp will tell you all in domain
config)#vtp version 3; you must be within a domain to change version and system must support
SW# vtp primary; if you do not choose a mode default is server vlan; 
SW#sh vtp devices; will show you the devices in the domain
config)# vtp mode server mst;
SW# vtp primary mst; will test your domain password!
If you want other devices to revieve mst information they must be set to client. By default they are transparent.
config)# vtp password jeff ?[ hidden | secret]
hidden you can never view plain text, secret then jeff would need to of been the hash
config-if)# no vtp; you can turn off globally or based on interface
password mechanism not interopable with version two, password used no propagation,->config)#no vtp password; solution
With my switches with version 2 to 3 no propagation waited, retested, nada 
pass: 52C518C46CE6647155DE01304CECA63E      cisco plain text, using for lab testing
whenever you clear password you have to become primary again for changes
c3750-ipservicesk9-mz.122-55.SE9.bin no propagation problems, my 3750 metro also no work but only supported v2 

___Trunk___ ISL- cisco propreitary  802.1q standard multivendor

ISL 30 bytes added encapsulates frame, 802.1q inserts tag in frame after src address
int fa 1/0/1;
switchport trunk encapsulation [isl | dot1q | negotiate]
switchport trunk native vlan vlan-id
switchport trunk allowed vlan [all | add | except | remove]
switchport mode [ trunk | dynamic desireable | dynamic auto]
If mode is in static trunk a trunk will come up if other side is [ trunk | desireable | auto]
if you want trunk static configure it up and encapsulation so there is less of a chance of problems
dyn des mode will bring up trunk if other side is [ trunk | dyn des | dyn auto]
dyn auto mode will bring up trunk if other side is [trunk | dyn des]  2 autos no go
dtp frames sent out every 30 seconds remember vtp is 300 or when vlan is changed dont get that confused!

___Errdisable____
By default a catalyst switch detects an error condition one every port for every cause.
Error is detected switch is put into errdisable. Tune behavior from glocal configuration.
config)#no errdisable detect cause [all | cause-name]; remove all errdisable or a specific one by name
You can automatically recover from errdisable.
config)#errdisable recovery cause [ all | cause-name]; default is 300 seconds to bring port up
config)#errdisable recovery interval seconds; seconds should be actual seconds not typed word
___errdisable____
____CDP---LLDP_____
config)# do show cdp neighbors [type member/module/portnum]; can show all or specific so last part not needed
config)#do show cdp neigh detail- lots of info including ip can also be used with aboce commands
config)# no cdp run; turn off cdp----->config)#cdp run; turns it back on
config-if)#no cdp enable;---->config-if)cdp enable; cdp on or off on interface, security reasons!
LLDP- Link Layer Discovery Protocol - 802.ab IEEE standard can be used with linux servers and many other devices
SW#show lldp; find out if its running or not
config)# lldp run;--->config)#no lldp run; turns lldp on or off
config)# do sh lldp neighbors; once again have the options to set specific interface or details for granularity
config-if)#no lldp [receive | transmit] once enabled globally works on every port use int commands for granularity
____cdp---lldp____
____POE---UPOE____
Switch detects weather a powered device is connected to port. If it is switch provides power. Sends out small power, and
sees if there is a device drawing power. BAsically just does a test for draw.
default class 0 is used if switch or powered device does not support or does not attempt optional power class discovery
class 0 15.4W, class 1 4.0W, class 2 7.0W, class 3 15.4 W, class 4 30W. CISCO Universalpoe max 60W
by default switch offers maximum of 15.4W per port. IF device needs additional power is can tell switch with CDP-LLDP
config-if)#power inline [ auto | static] max maxmilliwatts; everything is in milla so 15.4 W is 15400
config-if)power inline never; disable poe on a switch port
SW#sh power inline; displays switch ports and their current states
use cases? Typically phones or security cameras.
SW#sh power inline g 1/0/19; detail is optional if you want lots of data
___poe---upoe____
____EXTRA-LIGHT-ON-TOPICS___
Why does cdp work with misconfigured native vlan and what is happening.
Switch A native vlan 3, Switch B native vlan 6. Device traffic uses the native vlan and native vlan is untagged so
basically switch a non tagged vlan traffic can hop on over to switch B vlan 6 which is also non tagged across trunk
Basically you don't want traffic hopping vlans at layer 2, thats what inter vlan routing is for. Don't be suprised if you get
inconsistent behavior one day I could jump vlans next day Spantree-blocked vlan 2&3 no communication, fixed native vlan
%SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking FastEthernet1/0/48 on VLAN0002. Port consistency restored. so its iffy
VTP domain mismatch will not allow trunks to come up through negotiation, or if static trunk, trunk will
come up but vtp information will not be propogated.
____extra-light-on-topics___
____CAM_____ Content Addresable Memory  - mac address-table layer 2 movements
show mac address-table; you can use many switches [dynamic, static, vlan, int]
show mac address-table count; display current cam table length
mac address-table static mac-address vlan vlan-id int fa 1/0/48; add a stiatic address in the cam table
clear mac address-table dynamic mac-address int fa 1/0/48 vlan vlan-id; remove a specific entry in cam
to change the size of the mac address table you need to use sdm
____cam____
____TCAM_____ Ternary Content-Addressable Memory -  Ternary just stands for 3 -VMR
two tcams one for ACL and one for Qos ACL
show platform tcam utilization;
show tcam counts; monitor utilization of tcam and lous
show platform hardware capacity acl;
show tcam lou;
Value-134 bit and holds--->protocol,Tos, source, src port, s port lou, dest, dest port,d port lou
Mask-
Result- permit or deny
each mask has a dest mask and source and for that pairing there can be 8 entries in that section
LOU- logical operation unit- lt-less than, gt-greater than, eq-equal to, neg-not equal to, range
if you run out of lou space done in hardware you can expand this to be done in software
It is NOT correct to directly correlate number of ACEs configured to number of masks/entries used.
As you might be aware, an ACL and the TCAM are order dependent. For 2 ACEs to share the same mask
besides having the don’t care bits in the same locations they need to be adjacent to each other in the ACL definition.
Example:
permit any host 192.168.10.0;permit any host 192.168.10.1;- this can be represented by one tcam entry
Permit 192.10.10.0 255.255.255.254
Defining logical operations in ACL to optimize usage of TCAM/LOUs
if you run out of lou you should just state specifics lets say we want Permit any host 192.10.10.1 tcp range 1020 1023 any 
and we can not use more hardware lous then we
Permit any host 192.10.10.1 tcp 1020 any; Permit any host 192.10.10.1 tcp 1021 any; Permit any host 192.10.10.1 tcp 1022 any; Permit any host 192.10.10.1 tcp 1023 any
attempt to reuse lous already created for other ACE when possible
https://supportforums.cisco.com/t5/network-infrastructure-documents/acl-tcam-and-lous-in-catalyst-6500/ta-p/3115339
_____tcam_____
____SDM_____ - Switching Database Manager  manages partition sizes for efficient switching
show sdm prefer
sdm prefer tempplate; template will be of your choosing ie default,access,vlan,routing 
sizes are much smaller while dual stacking ipv4 and ipv6
If your switch does not have ipv6 commands change the sdm template to ipv4-ipv6 dual stack
___sdm____
____FREERADIUS_____
http://wiki.freeradius.org/guide/SQL-HOWTO-for-freeradius-3.x-on-Debian-Ubuntu
___freeradius____
____TACACS+_____
http://www.ebrahma.com/2015/06/configuring-mysql-aaa-authentication-and-accounting-with-tacacs-on-linux/
possibly promising based on the date
____tacacs+______
____VOICE_____
switchport voice vlan [ vlan-id | dot1p | untagged | none]                  voice         pc     here untagged meaning native vlan
none- by default phone acts as a switch so both devices are in the same access vlan    access vlan
untagged - both  voice and pc are                                         untaggedn     untagged
dot1p-  puts voice packets on vlan0                                       vlan 0          untagged
vlan-id  more commonly used                                               vlan-id        untagged
___voice_____
___WIRELESS___
TWo options either autonomous or lightweight mode.
Autonomous utilizes a trunk with vlans that are associated so set up trunk as normal with perticular allowed vlan for wifi
lightweight - this configuration utilizes the normal lan access -> switchport access vlan 33;
lightweight - can not act independantly of the controller
to distinguish what kind of access point look at part number AIR-LAPXXXX   AIR-APXXXX 
___wireless_____
____STP____
two types of BPDU= Configuration- PBDU used for computation. Topology Change Notification(TCN)- used to announce changes.
BPDUs are sent out for root bridge election. Configuration BPDUs are only sent by the root bridge after election occured.
Each bridge will add its sender id to the BPDU.
BPDUs will be analyzed to see if a better root bridge exist. As one may enter network at anytime.
Every switch thinks it is the root bridge until it receives a bpdu with a bidge with a lower bridge-id
BPDU root path cost incremented on receiving interface.
States- BDLLF Disabled, Blocking, Listening, Learning, Forwarding.  Both listening and learning have a 15 second delay.
Blocking rec bpdu, listening send & receive bpdu, learning send & rec & learn mac, forwarding everything plus send and rec data
If a port state changes a switch sends TCN BPDU to root bridge letting the root bridge know of the change. Unless port has portfast
enabled then no change will be sent at all.
TCN is sent if link goes down, but if link stays up and data is filtered, max age timer will age out the best bpdu and then
next best bpdu will become root port. Max age timer is 20 seconds by default, hello is 2, listen 15, learn 15.
When a tcn is sent to root bridge, mac addy tables timer goes down to 15 seconds to flush old addresses.
config)#spanning-tree vlan 2,3,4,7-9 root primary diameter 3 hello-time 1;
default diameter is 7. Diameter values 1-7.diameter adjusts timers based on layer 2 size, max-age, listen/learn forward delay
Portfast- port immediately goes into forwarding state. STP still runs! Would still go to blocking if loop detected.
Uplinkfast-image two links going to distribution switches. Port goes down it takes STP too long to converge. Uplinkfast detects
link going down and immediately puts second suitiable link up. Can work for many uplinks.
backbonefast-actively determines weather there is alternate paths to root bridge, incase indirect link failure.
Detects indirect link failure when the switch receives inferior bpdu from a SW announcing itself as root bridge.(unwanted root bridge)
-if inferior bpdu arrives on port in blocking state, SW considers the root port and all other blocked ports to be alternative paths to the
root bridge.
-if inferior bpdu arrives on the root port itself the switch consider all blocked port to be alternative paths to the root bridge.
-if inferior bpdu arrives on the root port and no ports are blocked, however the Sw assumes that is has lost connectivity with the
root bridge. SW assumes it is the root bridge. Back bone fast allows it to do so before the max age timer expires. 
backbonefast basically bypasses the max age timer.
SW#debug spanning-tree events;
___STP____
___STP-Tools____
root guard- if bpdu is received on  a port that is superior the port goes into root-inconsistent state, 
but BPDUs can still be sent.must be en on int (config-if)# spanning-tree guard root; on int we don't want a root bridge but do want bpdu
SW# show spanning-tree inconsistentports; shows you ports that are in effect due to root guard
port will be put in blocking mode and no data will be able to traverse this port.
bpdu guard- any bpdu received on a port will be put into errdisable.
config-if)#[no] spanning-tree bpduguard enable;(config)#spanning-tree portfast bpduguard enable;
loop guard- loopguard keeps track of BPDUs on all ports. While bpdu are received everything is fine.
BPDUs go missing loop guard moves this port into loop-inconsistent state. Port in B or A to keep from loop coming up.
Key here is sudden loss of bpdu weather port is in forward or B or A either way loss of bpdu blocking state.
(config)#spanning-tree loopguard default;(config-if)#spanning-tree guard loop; global or int
UniDirectional Link Detection-
config)#udld ?; aggressive will actually bring int down, normal will only send message.global conf only affects fiber ports
config-if)#udld port aggressive; enable on both sides of the link, both machines!
SW3(config)#mac access-list extended UDLD-FILTER
SW3(config-ext-macl)#deny any host 0100.0ccc.cccc
SW3(config-ext-macl)#permit any any
SW3(config-ext-macl)#exit
SW3(config)#interface fa0/16
SW3(config-if)#mac access-group UDLD-FILTER in
How to test loosing udld traffic and forcing the fiber int down. udld uses special unique mac, 0100.0ccc.cccc
show udld fa 0/16; shows the state of udld for int. or use -->SW#show udld;
config)#udld reset; if a port is in errdisable udld reset will bring those ports up
bpdufilter- stops bpdu from being sent out interfaces
config)#spanning-tree portfast bpdufilter default; only on portfast interfaces bpdufilter will run
config-if)#spanning-tree bpdufilter; stops BPDUs from being sent out an interface, 
___stp-tools___
____RSTP____
BPDUs are sent out every switch port at hello time intervals, regardless weather BPDUs are received or not.
this way a switch can detect a dead neighbor in 6 seconds, 3 hello-intervals by default
Upon TC all non edge macs in the cam are flushed.
config)#spanning-tree mode rapid-pvst,config)#spanning-tree mode pvst;
RSTP can revert to 802.1d by reading the version type in the bpdu 1 is 802.1d, 2 is 802.1w
if it detects 802.1d it will play by those rules on the port.
port roles-
Alternate port- alternate port to root different segment, like a port in blocking mode 802.1d
an alternate will go right into forwarding if root goes down and it is the best alternate
backup port- another port on same segment. switch connected to hub both int conn to hub port receives its own BPDU
port types-
Edge port- single host, RSTP knows by portfast feature enabled. If BPDU ever received port looses edge port status.
root port-port that has best cost path to root port
point-to-point port- any point that connects to another switch and becomes a designated port.
port-states-
Discarding- basically the blocking and listening wrapped up into one state
learning- same as 802.1d learns macs added
forwarding- same as 802.1d forwards data frames.
all ports communicate and no max age timer, no need for backbonefast
keeps track of alternate paths and if root port goed down promptly bring up alternate port, no need for uplinkfast
___rstp____
___MSTP____
Switches in a MST region need to figure out if their neighbor is in same region, uses a hash of region table.
Attributes that need to match: config name, revision number, mapping table. Not same it is seen as boundary.
IST(internal spanning tree)default is 0, rapid-spt runs within mstp. might see CSTP- common and internal spanning tree
config)#spanning-tree mode mst; enable the mode globally
config)#spanning-tree mst configuration; enabples you to get into config mode
config-mst)#name regionname; assigning a region name
config-mst)#revision version; revision number to keep track of updating info all switches must have same revision version
config-mst)#instance instance-id vlan vlan-list;id 0-15, by default all vlans mapped to ist 0
config-mst)#show pending; show pending changes
config-mst)#exit; commits changed to the active MST
config)#spanning-tree mst 0 priority 4096; alter the root bridge for instances
#show spanning-tree mst,SW#show spanning-tree mst configuratoin;
MSTP-VSTP+ the vstp+ swtich will only see the IST info because only the IST is pushed out of the region. 
There fore all vlans will take the best route to the IST root and is not based on mst at all, but is based on vlan 1
mstr FWD is the master port for uplink root port usually for the CIST in a multi-region MST operation
Root BKN*- Broken there is a problem, my problem the root bridge for all my vlans was outside the MST region.
you can think of mst in an area as a bridge.
___mstp____
