";" will represent stacking commands as if shell is enabled
___Basics____
The cam and mac addy: A switch by default ages a mac address after 300 seconds but if the interface where the switch learned the mac
address goes down it automatically drops the mac from the cam or if it learns of a mac address on a different port it gets rid of the mac
the existed before  the new one else where. There is always exceptions to every rule!
int fa 1/0/1; means interface type stack-member/module/portnumber- you will usually only see modules with routers.
creating a macro for lots of configurations-
config)#define interface-range MymacroName fa 1/0/1 - 4 , fa 2/0/3 - 7, g 3/0/1 , g 3/0/2
config)#int r macro MymacroName;  book says always use spaces with hyphens and commas
___basics____
___VTP____
vtp version 3 allows vlans in the extended range to be configured 1006- 4094
vtp version 1 &2 will also allow extended vlans but only in transparent mode.
VTP advertisements:
summary advertisement- sent every 300 seconds or vlan database change. For vlan config changes subset adv will follow.
subset advertisement- created or deleted vlan, suspending or activating vlan, change in MTU, status, type,SAID security association identifier
advertisement request from client- switch reset, vlan database cleared, vtp domain change, summ adv with higher revision number
will spon advertisement requests from clients to gather vtp info- server will send summary adv, then subset adv.
Storage: server mode stores vlan and vtp in vlan.dat stored on flash memory, not with config which is in NVRAM
upon reboot a server will have all its last known vlan data and vtp.
Two ways to get revision to 0- change domain, change mode to transparent.
CLIENT SENDS ADVERTISEMENTS WHEN IT FIRST POWERS UP!!!- Upon reboot if a client has higher revision could cause catastrophe.
VTP revision number is saved in NVRAM.
show vtp status; show int fa 1/0/1 [pruning | switchport];
vtp mode [ server | client | transparent | off]
vtp password [hidden | secret]; hidden-hash is saved in run-conf. secret the password is saved in run-conf
config)#vtp pruning; enables vtp pruning on device. This will stop unneeded traffic across trunk but not spanning tree instances
config-if)# switchport trunk vlan allowed 3,4,5; manually prune traffic and stp on for these vlans
config-if)#switchport trunk pruning vlan [add | except | none | remove]; granular config of pruning, default prunes all
SW# delete vlan.dat; delete your vlan and vtp database
recall revision number is stored in NVRAM!
Two switches connected on trunk no vtp domain configured- no propogation
-----labs tests and results-----
LAb1
Sw1 server sw2 server to gain database, change sw2 to client, introduce bad update as if bad switch introduced,
take down trunk and reload- results= bad data still in switch , next erase nvram- results=same bad vlan info
Lab2
Introduce client in environment with higher revision number- results = it will override vtp server data, vtp client with
higher revision number is just as dangerous as server w/ highest revision number, wins even if client.
Lab3 erase nvram;reload; on both client and server result= all vtp and vlan information present including revision. data stored in vlan.dat
I don't care what the books say data is stored, it is in vlan.dat, only difference between clinet and server is client cannot
create vlans only server can alter. Client can not alter internal data but will destroy everyones elses if has higher revision.

___vtp____
___VTP-Version3____
Primary server- Only I can change database info. No clinets or other servers over riding with higher revision
extended vlans- 1006-4094 supported
private vlans- supported, database info but not port info
rspan- remote span will also propagate. Basically supported meaning propagate the vtp domain
mstp support-
Auth- hidden allows you to put in pass and can not view plain text only 32 hex chars
secret- allows you to put the hex pass in to enter domain
off- completely turn off as compared to 2 or 1 neeed transparent which still porpagated but did not synch.
compatibility- compatible with version 2 not 1. but as expected 2 is limited to 2s features only
show vtp devices; unlike CDP vtp is not limited to directly connected devices, vtp will tell you all in domain
config)#vtp version 3; you must be within a domain to change version and system must support
SW# vtp primary; if you do not choose a mode default is server vlan; 
SW#sh vtp devices; will show you the devices in the domain
config)# vtp mode server mst;
SW# vtp primary mst; will test your domain password!
If you want other devices to revieve mst information they must be set to client. By default they are transparent.
config)# vtp password jeff ?[ hidden | secret]
hidden you can never view plain text, secret then jeff would need to of been the hash
config-if)# no vtp; you can turn off globally or based on interface
password mechanism not interopable with version two, password used no propagation,->config)#no vtp password; solution
With my switches with version 2 to 3 no propagation waited, retested, nada 
pass: 52C518C46CE6647155DE01304CECA63E      cisco plain text, using for lab testing
whenever you clear password you have to become primary again for changes
c3750-ipservicesk9-mz.122-55.SE9.bin no propagation problems, my 3750 metro also no work but only supported v2 

___Trunk___ ISL- cisco propreitary  802.1q standard multivendor

ISL 30 bytes added encapsulates frame, 802.1q inserts tag in frame after src address
int fa 1/0/1;
switchport trunk encapsulation [isl | dot1q | negotiate]
switchport trunk native vlan vlan-id
switchport trunk allowed vlan [all | add | except | remove]
switchport mode [ trunk | dynamic desireable | dynamic auto]
If mode is in static trunk a trunk will come up if other side is [ trunk | desireable | auto]
if you want trunk static configure it up and encapsulation so there is less of a chance of problems
dyn des mode will bring up trunk if other side is [ trunk | dyn des | dyn auto]
dyn auto mode will bring up trunk if other side is [trunk | dyn des]  2 autos no go
dtp frames sent out every 30 seconds remember vtp is 300 or when vlan is changed dont get that confused!

___Errdisable____
By default a catalyst switch detects an error condition one every port for every cause.
Error is detected switch is put into errdisable. Tune behavior from glocal configuration.
config)#no errdisable detect cause [all | cause-name]; remove all errdisable or a specific one by name
You can automatically recover from errdisable.
config)#errdisable recovery cause [ all | cause-name]; default is 300 seconds to bring port up
config)#errdisable recovery interval seconds; seconds should be actual seconds not typed word
___errdisable____
____CDP---LLDP_____
config)# do show cdp neighbors [type member/module/portnum]; can show all or specific so last part not needed
config)#do show cdp neigh detail- lots of info including ip can also be used with aboce commands
config)# no cdp run; turn off cdp----->config)#cdp run; turns it back on
config-if)#no cdp enable;---->config-if)cdp enable; cdp on or off on interface, security reasons!
LLDP- Link Layer Discovery Protocol - 802.ab IEEE standard can be used with linux servers and many other devices
SW#show lldp; find out if its running or not
config)# lldp run;--->config)#no lldp run; turns lldp on or off
config)# do sh lldp neighbors; once again have the options to set specific interface or details for granularity
config-if)#no lldp [receive | transmit] once enabled globally works on every port use int commands for granularity
____cdp---lldp____
____POE---UPOE____
Switch detects weather a powered device is connected to port. If it is switch provides power. Sends out small power, and
sees if there is a device drawing power. BAsically just does a test for draw.
default class 0 is used if switch or powered device does not support or does not attempt optional power class discovery
class 0 15.4W, class 1 4.0W, class 2 7.0W, class 3 15.4 W, class 4 30W. CISCO Universalpoe max 60W
Upoe is only offered by the catalyst 4500 as of my book which is like 2015
by default switch offers maximum of 15.4W per port. IF device needs additional power is can tell switch with CDP-LLDP
config-if)#power inline [ auto | static] max maxmilliwatts; everything is in milla so 15.4 W is 15400
config-if)power inline never; disable poe on a switch port
SW#sh power inline; displays switch ports and their current states
use cases? Typically phones or security cameras or wap
SW#sh power inline g 1/0/19; detail is optional if you want lots of data
___poe---upoe____
____EXTRA-LIGHT-ON-TOPICS___
Why does cdp work with misconfigured native vlan and what is happening.
Switch A native vlan 3, Switch B native vlan 6. Device traffic uses the native vlan and native vlan is untagged so
basically switch a non tagged vlan traffic can hop on over to switch B vlan 6 which is also non tagged across trunk
Basically you don't want traffic hopping vlans at layer 2, thats what inter vlan routing is for. Don't be suprised if you get
inconsistent behavior one day I could jump vlans next day Spantree-blocked vlan 2&3 no communication, fixed native vlan
%SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking FastEthernet1/0/48 on VLAN0002. Port consistency restored. so its iffy
VTP domain mismatch will not allow trunks to come up through negotiation, or if static trunk, trunk will
come up but vtp information will not be propogated.
____extra-light-on-topics___
____CAM_____ Content Addresable Memory  - mac address-table layer 2 movements
show mac address-table; you can use many switches [dynamic, static, vlan, int]
show mac address-table count; display current cam table length
mac address-table static mac-address vlan vlan-id int fa 1/0/48; add a stiatic address in the cam table
clear mac address-table dynamic mac-address int fa 1/0/48 vlan vlan-id; remove a specific entry in cam
to change the size of the mac address table you need to use sdm
____cam____
____TCAM_____ Ternary Content-Addressable Memory -  Ternary just stands for 3 -VMR
two tcams one for ACL and one for Qos ACL
show platform tcam utilization;
show tcam counts; monitor utilization of tcam and lous
show platform hardware capacity acl;
show tcam lou;
Value-134 bit and holds--->protocol,Tos, source, src port, s port lou, dest, dest port,d port lou
Mask-
Result- permit or deny
each mask has a dest mask and source and for that pairing there can be 8 entries in that section
LOU- logical operation unit- lt-less than, gt-greater than, eq-equal to, neg-not equal to, range
if you run out of lou space done in hardware you can expand this to be done in software
It is NOT correct to directly correlate number of ACEs configured to number of masks/entries used.
As you might be aware, an ACL and the TCAM are order dependent. For 2 ACEs to share the same mask
besides having the don’t care bits in the same locations they need to be adjacent to each other in the ACL definition.
Example:
permit any host 192.168.10.0;permit any host 192.168.10.1;- this can be represented by one tcam entry
Permit 192.10.10.0 255.255.255.254
Defining logical operations in ACL to optimize usage of TCAM/LOUs
if you run out of lou you should just state specifics lets say we want Permit any host 192.10.10.1 tcp range 1020 1023 any 
and we can not use more hardware lous then we
Permit any host 192.10.10.1 tcp 1020 any; Permit any host 192.10.10.1 tcp 1021 any; Permit any host 192.10.10.1 tcp 1022 any; Permit any host 192.10.10.1 tcp 1023 any
attempt to reuse lous already created for other ACE when possible
https://supportforums.cisco.com/t5/network-infrastructure-documents/acl-tcam-and-lous-in-catalyst-6500/ta-p/3115339
_____tcam_____
____SDM_____ - Switching Database Manager  manages partition sizes for efficient switching
show sdm prefer
sdm prefer tempplate; template will be of your choosing ie default,access,vlan,routing 
sizes are much smaller while dual stacking ipv4 and ipv6
If your switch does not have ipv6 commands change the sdm template to ipv4-ipv6 dual stack
___sdm____
____FREERADIUS_____
http://wiki.freeradius.org/guide/SQL-HOWTO-for-freeradius-3.x-on-Debian-Ubuntu
___freeradius____
____TACACS+_____
http://www.ebrahma.com/2015/06/configuring-mysql-aaa-authentication-and-accounting-with-tacacs-on-linux/
possibly promising based on the date
____tacacs+______
____VOICE_____
switchport voice vlan [ vlan-id | dot1p | untagged | none]                  voice         pc     here untagged meaning native vlan
none- by default phone acts as a switch so both devices are in the same access vlan    access vlan
untagged - both  voice and pc are                                         untaggedn     untagged
dot1p-  puts voice packets on vlan0                                       vlan 0          untagged
vlan-id  more commonly used                                               vlan-id        untagged
___voice_____
___WIRELESS___
TWo options either autonomous or lightweight mode.
Autonomous utilizes a trunk with vlans that are associated so set up trunk as normal with perticular allowed vlan for wifi
lightweight - this configuration utilizes the normal lan access -> switchport access vlan 33;
lightweight - can not act independantly of the controller
to distinguish what kind of access point look at part number AIR-LAPXXXX   AIR-APXXXX 
___wireless_____
____STP____
two types of BPDU= Configuration- PBDU used for computation. 
Topology Change Notification(TCN)- used to announce changes. 
A bridge gets a topolgy change it sends a TCN out its root port at hello interval until root bridge responds with a TCN acknowledgment bitset
BPDUs are sent out for root bridge election. Configuration BPDUs are only sent by the root bridge after election occured.
Each bridge will add its sender id to the BPDU.
BPDUs will be analyzed to see if a better root bridge exist. As one may enter network at anytime.
Every switch thinks it is the root bridge until it receives a bpdu with a bidge with a lower bridge-id
BPDU root path cost incremented on receiving interface.
States- BDLLF Disabled, Blocking, Listening, Learning, Forwarding.  Both listening and learning have a 15 second delay.
Blocking rec bpdu, listening send & receive bpdu, learning send & rec & learn mac, forwarding everything plus send and rec data
If a port state changes a switch sends TCN BPDU to root bridge letting the root bridge know of the change. Unless port has portfast
enabled then no change will be sent at all.
TCN is sent if link goes down, but if link stays up and data is filtered, max age timer will age out the best bpdu and then
next best bpdu will become root port. Max age timer is 20 seconds by default, hello is 2, listen 15, learn 15.
When a tcn is sent to root bridge, mac addy tables timer goes down to 15(or forward time) seconds to flush old addresses.
config)#spanning-tree vlan 2,3,4,7-9 root primary diameter 3 hello-time 1;
default diameter is 7. Diameter values 1-7.diameter adjusts timers based on layer 2 size, max-age, listen/learn forward delay
Portfast- port immediately goes into forwarding state. STP still runs! Would still go to blocking if loop detected.
Uplinkfast-image two links going to distribution switches. Port goes down it takes STP too long to converge. Uplinkfast detects
link going down and immediately puts second suitiable link up. Can work for many uplinks.
sends known mac addresses to dummy multicast addresses on new uplink, so the new uplink switch knows those hosts are on new port.
since it is important that this protocol not be on a upstream bridge its priority is set high and all port priorities are incremented
Flexlinks- disables STP and convergence is 50 ms one port is active one port is backup you need one active port then you configure
the backup ->config)#int fa 1/0/1; switchport backup int fa 1/0/2; configure the backup on the active int.
SW#sh int switchport backup; will show you active backup ports
backbonefast-actively determines weather there is alternate paths to root bridge, incase indirect link failure.
Detects indirect link failure when the switch receives inferior bpdu from a SW announcing itself as root bridge.(unwanted root bridge)
-if inferior bpdu arrives on port in blocking state, SW considers the root port and all other blocked ports to be alternative paths to the
root bridge. So an RLQ will be sent out the root port and all blocked ports to verify root bridge.
-if inferior bpdu arrives on the root port itself the switch consider all blocked port to be alternative paths to the root bridge.
-if inferior bpdu arrives on the root port and no ports are blocked, however the Sw assumes that is has lost connectivity with the
root bridge. SW assumes it is the root bridge. Back bone fast allows it to do so before the max age timer expires. 
backbonefast basically bypasses the max age timer.
SW#debug spanning-tree events;
___STP____
___STP-Tools____
root guard- if bpdu is received on  a port that is superior the port goes into root-inconsistent state, 
but BPDUs can still be sent.must be en on int (config-if)# spanning-tree guard root; on int we don't want a root bridge but do want bpdu
SW# show spanning-tree inconsistentports; shows you ports that are in effect due to root guard
port will be put in blocking mode and no data will be able to traverse this port.
bpdu guard- any bpdu received on a port will be put into errdisable.
config-if)#[no] spanning-tree bpduguard enable;(config)#spanning-tree portfast bpduguard enable;
loop guard- loopguard keeps track of BPDUs on all ports. While bpdu are received everything is fine.
BPDUs go missing loop guard moves this port into loop-inconsistent state. Port in B or A to keep from loop coming up.
Key here is sudden loss of bpdu weather port is in forward or B or A either way loss of bpdu blocking state.
(config)#spanning-tree loopguard default;(config-if)#spanning-tree guard loop; global or int
UniDirectional Link Detection-
config)#udld ?; aggressive will actually bring int down, normal will only send message.global conf only affects fiber ports
config-if)#udld port aggressive; enable on both sides of the link, both machines!
SW3(config)#mac access-list extended UDLD-FILTER
SW3(config-ext-macl)#deny any host 0100.0ccc.cccc
SW3(config-ext-macl)#permit any any
SW3(config-ext-macl)#exit
SW3(config)#interface fa0/16
SW3(config-if)#mac access-group UDLD-FILTER in
How to test loosing udld traffic and forcing the fiber int down. udld uses special unique mac, 0100.0ccc.cccc
show udld fa 0/16; shows the state of udld for int. or use -->SW#show udld;
config)#udld reset; if a port is in errdisable udld reset will bring those ports up
bpdufilter- stops bpdu from being sent out interfaces
config)#spanning-tree portfast bpdufilter default; only on portfast interfaces bpdufilter will run
config-if)#spanning-tree bpdufilter; stops BPDUs from being sent out an interface, 
___stp-tools___
____RSTP____
BPDUs are sent out every switch port at hello time intervals, regardless weather BPDUs are received or not.
this way a switch can detect a dead neighbor in 6 seconds, 3 hello-intervals by default
Upon TC all non edge macs in the cam are flushed except the port where it was received.
config)#spanning-tree mode rapid-pvst,config)#spanning-tree mode pvst;
RSTP can revert to 802.1d by reading the version type in the bpdu 1 is 802.1d, 2 is 802.1w
if it detects 802.1d it will play by those rules on the port.
port roles-
Alternate port- alternate port to root different segment, like a port in blocking mode 802.1d
an alternate will go right into forwarding if root goes down and it is the best alternate
backup port- another port on same segment. switch connected to hub both int conn to hub port receives its own BPDU
port types-
Edge port- single host, RSTP knows by portfast feature enabled. If BPDU ever received port looses edge port status.
root port-port that has best cost path to root port
point-to-point port- any point that connects to another switch and becomes a designated port.
port-states-
Discarding- basically the blocking and listening wrapped up into one state
learning- same as 802.1d learns macs added
forwarding- same as 802.1d forwards data frames.
all ports communicate and no max age timer, no need for backbonefast
keeps track of alternate paths and if root port goed down promptly bring up alternate port, no need for uplinkfast
Sync Process:When better root bridge information is received, or root port changes, the local bridge blocks all non-edge designated ports. 
Effectively, those are the ports connected to the bridges that are supposed to be downstream to the new root. After this, the local bridge 
sets Proposal flag in the outgoing BPDU sent out of potential Designated ports.
Notice that no BPDUs are yet being sent out of the new root port – only the downstream ports are synchronized.
Downstream Bridges compare Proposal with their Root bridge is new info is superior it elects new root port and blocks all down stream ports
After receiving an Agreement message, the upstream bridge unblocks its downstream ports and continues forwarding. The blocked ports are now 
moved to the downstream bridges, which continue the synchronization process, until all brides in the topology are affected
When a bridge rejects a Proposal it has better root bridge information. In this case, it sends back alternate proposal message with its own 
root bridge information.
RSTP does not use RLQ and check if bridge actually exists. It will directly send BPDUs to neighbor stating who the root bridge is
without querying this quite create and infinitiy instance and create problems in some topologies. Stale Root BPDU bad
___rstp____
___MSTP____
Switches in a MST region need to figure out if their neighbor is in same region, uses a hash of region table.
Attributes that need to match: config name, revision number, mapping table. Not same it is seen as boundary.
IST(internal spanning tree)default is 0, rapid-spt runs within mstp. might see CSTP- common and internal spanning tree
config)#spanning-tree mode mst; enable the mode globally
config)#spanning-tree mst configuration; enabples you to get into config mode
config-mst)#name regionname; assigning a region name
config-mst)#revision version; revision number to keep track of updating info all switches must have same revision version
config-mst)#instance instance-id vlan vlan-list;id 0-15, by default all vlans mapped to ist 0
config-mst)#show pending; show pending changes
config-mst)#exit; commits changed to the active MST
config)#spanning-tree mst 0 priority 4096; alter the root bridge for instances
#show spanning-tree mst,SW#show spanning-tree mst configuratoin;
MSTP-VSTP+ the vstp+ swtich will only see the IST info because only the IST is pushed out of the region. 
There fore all vlans will take the best route to the IST root and is based on mst0 which is IST root.
mstr FWD is the master port for uplink root port usually for the CIST in a multi-region MST operation
Root BKN*- Broken there is a problem, my problem the root bridge for all my vlans was outside the MST region.
you can think of mst in an area as a bridge.
___mstp____
___MultilayerSwitch____
sh ip cef [ type member/module/number] vlan vlan-id [detail]; shows you your layer 3 info FIB
sh ip cef 10.1.0.0 255.255.0.0 longer-prefix; display fib for specific add and longer matches
adjacency table- FIB keeps layer 3 next-hop addresses, FIB keep layer 2 next-hop addy to stream line switching for layer 3
adjacency table- consists of mac addresses that can be reached in a single layer 2 hop.
show adjacency summary;


___multilayerswitch____
_____EtherChannel-PAgP____
config)# port-channel load-balance src-dst-port; many different options to decide how LDB algo works
PAgP- both desireable and auto mode default is silent submode, which states no PAgP packets are expected from the far end.
Ports set to non-silent submode PAgP packets must be received before a channel could form.
Auto -Auto will still not form a channel you need desireable-auto or d-d
show etherchannel summary;
show etherchannel port; member status of each port
show etherchannel detail;
show etherchannel load-balance;
test etherchannel load-balance; example to follow
test etherchannel load-balance interface port-channel <port-channel #><mac/ip> <source address> <destination address>"
SW#test etherchannel load-balance int port-channel 1 ip 1.1.1.1 2.2.2.2
show etherchannel port-channel; know this output and what the load means! load is hexadecimal!!
Index   Load   Port     EC state        No of bits
------+------+------+------------------+-----------
  0     55     Gi3/1    Active    4
  1     AA     Gi3/2    Active    4

change load value into binay say 01010101 0x55 RBH value of 2 4 6 8 this port would be used G3/1
same here 10101010 0xAA RBH value 1 3 5 7 this port used G 3/2    Active 4 4 is equal load balancing
https://supportforums.cisco.com/t5/network-infrastructure-documents/quot-etherchannel-loadbalancing-on-catalyst-switches-quot/ta-p/3107786
show [pagp | lacp] neighbor; check neighbors on ports
int fa 1/0/1; channel-protocol pagp; channel-group 1 mode [ on | auto | desireable ] [non-silent];
PAgP Silent mode is used to allow PAgP to create an Etherchannel without needing to receive PAgP packets from the far end on each 
of the links that need to be bundled.
Imagine you have a server or protocol analyzer attached to 4 ports. Servers and Protocol analyzers don't typically support PAgP 
but you would still like to use PAgP to ensure the port are configured appropriately. Thus, the silent submode.
This will allow PAgP to start the process of bundling the ports without needing to hear PAgP packets from the otherside.
non-silent- etherchannel does not form until bidirectional pagp communication has been confirmed. Default is silent
silent meaning channel does not require bidirectional pagp communication to be formed on this side.
on static on both sides control your aggregation and don't rely on negotiations.
remember you can assign ports to channel group and then.-->int port-channel 1; switport mode trunk;
if you configure the port channel all ports assigned to the channel with inherit the configuration
lacp
config)#lacp system-priority [priority]; lower priority side makes decision for channel's makeup
config)#int fa 1/0/1; channel-protocol lacp; channel-group 1 mode [on | passive | active];Config-if)# lacp port-priority [priority];
port priority is if you have more than 8 active links you can determine which 8 are active and which 8 standby links
SW(config)# spanning-tree etherchannel guard misconfig; if there is a misconfig STP puts ports in err disable
solve misconfig then -->int port-channel 3; shut; no shut;
show etherchannel port-channel; how to read output following link
https://supportforums.cisco.com/t5/network-infrastructure-documents/quot-etherchannel-loadbalancing-on-catalyst-switches-quot/ta-p/3107786
___etherchannel-pagp____
____TIME-NTP___
Time is based on UTC Universal Time Cordinate, PST is 8 hours behind UTC or -8, PDT pacific daylight savings during summer is -7
So you will use -7 if its after second sunday in march or before first sunday in november, becasue we have already been sprung forward an hour
SW# show clock; display clock time
SW#clock set 04:15:00 4 april 2018; set the internal clock time.
SW(config)#clock timezone PST [offset-hours offset-minutes]; -8 here for PST, -7 PDT
When you first put time in it uses UCT and then use offset to change 8 hours. So in clock set add 8 hours to time set.
SW(config)#clock summer-time name date start-month day year hh:mm end-month day year hh:mm offset-minutes;
OR
config)#clock summer-time name recurring start-week day month hh:mm end-week day month hh:mm offset-minutes
Big difference between the two above is using recurring with no information will use US standards.
if you use date instead of recurring it will only use it once based on specific date. Notice it asks for year
Exercise-
SW#clock set 07:00 1 january 2018;
SW(config)#clock summer-time name recurring 4 friday january 07:01 4 friday january 10:02 180
Personal note what would offset 182 here do? endless jumping cycle!
jump 3 hours ahead for one minute and then jump back,be careful on weeks 
NTP-SERVER
SW(config)#ntp server ip-address [prefer] [version 3|4]; configure client to get server info NTP info
SW(config)#ntp authentification-key key-number md5 key-string- set your md5 hash string for authentification
SW(config)#ntp authenticate; ntp trusted-key key-number;
SW(config)#ntp server ip-address key key-number;
SW(config)#access-list 1 permit 10.1.2.0 0.0.0.255; acl for ntp
SW(config)#ntp access-group [server-only | server | peer| query-only] acl-num;
Master:
switch(config)#ntp server pool.ntp.org; your master needs a server right... 
switch(config)#feature ntp; turning the feature on wasn't available and didn't need?
switch(config)#ntp master []- in the [] the stratum number goes
switch(config)#ntp authentification-key 42 md5 aNicekey;   -creates the key
switch(config)#ntp trusted key 42;key needs to be trusted for use in ntp packets
switch(config)#ntp authentification; write mem  *** save configs!!!
switch(config)#ntp source 10.100.100.10; creates the source ip for ntp to use
Client:
switch(config)#conf t; ntp server 10.100.100.10 key 42
switch(config)#ntp authentification-key 42 md5 aNicekey
switch(config)#show ntp authentification-keys  # verify that your key is there and correct
switch(config)#ntp trusted-key 42    -once again make sure key is trusted so system will use it in ntp transmissions
switch(config)#ntp authenticate		-
switch(config)#show ntp authentification-status
____time-ntp____
___Logging____
SW#show logging; show your logging you have buffered, by default nothing is buffered, only sent to console
terminal monitor; if you are remoting into machine and want logging to be displayed to screen.
SW(config)#logging console severity; change severity of logging, nice for labs so you dont get hints of problems
SW(config)#logging buffered severyity; change severity and quantity of messages logged to buffer
Remember before is ram and uses the system little ram that it has
SW(config)#loggin buffered size; will be 4096-gobbles of ram.
SW(config)#logging host ip-address; designate logging server
SW(config)#loggin trap severity; what level of messages get sent to server.
SW(config)#service timestamps log datetime [localtime] [show-timezone] [msec] [year]; deignate time info for logging
___logging___
____SNMP____
v1 community string no security 32-bit counters
v2 community string no security 64 bit counters introduced bulk request and informs- inform requires snmp manager response
v3 username password group belonging to restricted views of oids within MIB auth, encryptioin
v1: 
access-list 10 permit host 172.16.4.4; 
snmp-server community MonitorIT ro 10; read only becasue no security with comm string, this protects from any pooling device
snmp-server host 172.16.4.4 MonitorIT ?; where to send traps. you can specify traps hence ?
v2:
snmp-server community MonitorIT ro 10;
snmp-server host 172.16.4.4 informs version2c MonitorIT ?; informs key word if you want to require response ack. & state version2c
v3:
snmp-server view jeffsview oid-tree; allow specific oid trees to be viewed by certains groups iso top branch
snmp-server group jeffsgroup v3 [noauth | auth | priv] read [ read-view] write [write-view] notify [notify-view] access [acl#];
noauth-no authent or encrypt. auth- authent no encrypt. priv authent and encrypt.
snmp-server user jeffsuser jeffsgroup v3 priv md5 myauthpassword priv aes 128 myprivpassword [acl#]
snmp-server host 172.16.4.4 informs version 3 priv jeffsuser ?; specific trap types shows with ?
___snmp____
____IPSLA____ how to use with HSRP with track to decrement also hsrp without track
ip sla responder; needed for path-jitter or udp-jitter only 2 that require a responder
test options: icmp-echo,path-echo,path-jitter,dns,dhcp,ftp,http,udp-echo,udp-jitter,tcp-connect.
(config)#key chain [chain-name];
config-keychain)#key [key-number];(config-keychain-key)#key-string [mystringpass];exit
(config)#ip sla key-chain [chain-name]; use this keyname- a group of keys diff ones can be active at diff times for ip sla
configure ip sla:
(config)#ip sla [operation-number];icmp-echo [destin-addr] [source-addr]; frequency 30; default every 60 seconds change to .5 value
(config)#ip sla [oper-num]; udp-jitter [dest-ip] [dest-udp-port] [sourc-ip] [sourc-port] num-packets [pack#] interval [pack-int];
frequency [seconds]; by default interval ip sla runs every 60 sec
here  you would need the receiving machine to have ->ip sla responder;
(config)#ip sla schedule [operation-number] life [ forever| seconds#] start-time [now | specifc-date-time] ageout [seconds] recurring 
ageout will ageout data retrieved after given time. Recurring will work if used specific start time and it will run at the start time
again and again
TRACKING ip sla with track object and how to use within HSRP to detect down link change priority to bring other router up.
Remember you could always use the HSRP timers to communicate at a very high frequency and it checks down links also!!!
config)#track [object-num] ip sla [operation-#] [state | reachability]
state tracks return code weather up or down, reachability is based on a threshold
(config-if)# standby 1 track [object-num] decrement [decrement-value] ie
config-if)#standby 1 track 1 decrement 30; ip sla no reachbility this standby interface decrements by 60;
config-if)#standby 1 track s0/0 decrement 30; if exit interface goes down decrement priority by 30
With track you can check a few routers along the way and change interface
priority based on availability of say 5 hops away and not just exit int.
If there is a priority change you will neeed other router to have preempt to take over when priority changes
If no preempt router does not take over if there is already an active router, preempt means take over if I have best elect

show ip sla configuration; show your all configs
show ip sla statistics aggregated [operation#];by default latest results show aggregate creates a summary
___ipsla_____
___SPAN___Switch Port Analyzer
3750-X can support 2 sessions, 6500 can support 64 sessions.
LOCAL-SPAN:
SW(config)#monitor session 1 source int fa 1/0/1 [both | rx | tx];
source can also be a vlan ->source vlan 3 both;
SW(config)#monitor session 1 dest int fa 1/0/2;
span dest will not de able to send or receive data unless ->ingress [ dot1q vlan vlan-id | isl | untagged vlan vlan-id]
monitor session 1 dest int fa 1/0/2 ingress [ dot1q vlan vlan-id | isl | untagged vlan vlan-id]; I believe
monitor session 1 dest int fa 1/0/2 encapsulate replicate; be default STP-BPDUs,VTP,DTP,CDP,PaGP, not sent but encap rep makes it added
You can also span a trunk port where trunk is source and filter based on vlan
monitor session 1 filter vlan vlan-range; i beleieve the vlans in the range will be blocked
Span disables STP on the port so a bridged analyzer with 2 connects could cause loop
Remote-Span:
SwitchA:where host is at, SwitchB: intbetween switch w/ 2 trunks, SwitchC: where analyzer is.
SwitchA:
(config)#vlan 99; remote-span; all switches need the remote-span vlan
(config)#monitor session 1 source int gig 1/0/1 both;
(config)#monitor session 1 des remote vlan 99;
SwitchB:
(config)# vlan 99; remote-span; ensure its allowed over both trunks if manually pruning
SwitchC:
(config)#vlan 99; remote-span;
(config)# monitor session 1 source remote vlan 99;
(config)#monitor session 1 destin int fa 1/0/2;
(config)# no monitor session 1, no monitor session local;
SVI can not be used in span but source vlan can. destination van not be vlan unless it is remote vlan
VSPAN when you choose the source as a vlan all ports assigned to vlan become active as sources
Can not mix vlans and interfaces in same span session, but you can create multiple span sessions 1 for interfaces and 1 for vlans
and rememeber they can not have the same destination so you may need two analyzers.Unless remote same dest works, if remote vlan.
You can define more than one destination for a span session, but multiple span sessions can not share same destination. Unless remote.
Source and destination can be on different vlans, it doesn't really matter.
The destination can only be a vlan when it is remote.
___span____ switch port analyzer
____DHCP-DHCPv6____
SW#show ip dhcp binding; show addresses binding
SW#clear ip dhcp binding {* | ip-address}; clear a specific address or all of them
debug ip dhcp server; to debug any dhcp issues
configuring manual binding
ip dhcp pool serverdhcpaddyWhyjustusestatic;
host 192.168.1.201 255.255.255.0; client-identifier 0100.50b6.5bc0.b5;do wr 
the leading 01 is the identifier that the host is using ethernet, so the host mac addy is really 0050.b65b.c0b5
ip dhcp pool test; lease { infinite | days | hours | minutes]
SW(dhcp-config)#option option-num value; configure special options
options numbers- 43-> location of wireless lan controller for lightweight access point, 69-> SMTP server, 70 -> POP3 main server
150-> tftp server for cisco ip phone.
DHCP Relay should be configured on your layer 3 interface so that when it receives dhcp request it sends it accodingly 
ip helper-address 192.168.199.4; when layer 3 device sends message to server it tags the lan it came from so server knows proper address reply
you can choose multiple helper addresses and the client will choose which address to use if it receives multiple address responses.

IPV6 a host will use link-local FE80::/10 to find router and find out its subnet its on and can even generate its own unique ipv6 global address.
DAD is still used even for link local addresses not just global. anycast command after ip is so dad is not applied. remember RS- RA

the process to get your own unique address is called stateless autoconfiguration or serverless client configuration.
uses RS- client asks the router which subnet its on. RA- router advertises the subnet to the local subnet
the client uses 
Catalyst switches can also function as a IPv6DHCP server-
ipv6 dhcp pool my6pool; address prefix ipv6-prefix; second command here allows dhcp to send ipv6 addresses to hosts but is not necessary.
you can not exclude addresses or specify host bindings with dhcpv6, only ipv4 allows that.
SW(config-dhcpv6)#dns-server A::1; domain-name jeffsdomain.com;
With ipv6 you need to specify the pool under the ipv6 interface.
int fa 1/0/1; ipv6 address B::1/64; ipv6 dhcp server pool-name;no shut; never forget no shuts and your wr to save config!!!
DHCPv6 Lite 
SW(config-if)#ipv6 nd other-config-flag; enables dhcpv6 lite options, 
ipv6 dhcp server mylitepool; this pool that is light should defintely not have the ->address prefix A:A:A:A::/64 command. no addresses assigned
DHCPv6 relay
SW(config-if)# ipv6 dhcp relay destination C::1; ipv6 int relays dhcp options to the server and interface relays back to host.
show ipv6 dhcp pool; shows you all your pools and their configs
___dhcp-dhcpv6____
__High-Availability-StackWise-Chassis____
Cisco offers switches with a chassis with slots that contain multiple switching modules, contains supervisor module that handles
all the switching management functions, you can think of supervisor kind of like stack master. Can have redundant supervisor module.
ie Catalyst 4500R, 6500, 8500 are chassis switch models
VSS- Virtual Switching System- configuring two identical chassis to operate as one logical switch.
VSL-Virtual Switch Link- is used to form he VSS.
RPR- Route Processor Redundancy-supervisor partially booted and initialized
RPR+- booted and supervisor and route engine is initialized
SS0-Stateful Switchover- redundant supervisor fully booted and initialized, Route Engine, layer 2 and FIB initialized and synchronized.
NSF-Non stop forwarding with SS0 and NSF router gains all the routing information must be configured on both routers
RPR+ - requires the same image on both supervisors.
___high-availability___
____StackWise____
Up to 9 SW in stack. Can remove or add anywhere without dirupting communication with a daisy chain.
Election: 
user selected priority-
Hardware/software priority-higher feature set ipservices over ipbase
Default config- switch with config takes precedence over one with no config
Uptime- switch with loner uptime
Mac address-lowest mac address wins, kind of like bridge election STP lowest mac wins there also
User priority example:SW(config)#switch 1 priority 15; may need to reboot to make sure priority is used. ->wr;reload
values for priority are 1 to 15. Default value is 1.
can be changed from global config or boot loader Switch: prompt->Swtich: set SWITCH_PRIORITY 7;
make sure sdm templates are the same.
Software compatibility between the stack members is determined by the Stack Protocol Version number. To view the stack protocol version of 
your switch stack, you can issue the show platform stack manager all command.
SW#show platform stack manager all
Switches with the same Cisco IOS software version have the same stack protocol version. Such switches are fully compatible, and all features
function properly across the switch stack. Switches with the same Cisco IOS software version as the stack master immediately join the switch stack.
If an incompatibility exists, the fully functional stack members generate a system message that describes the cause of the incompatibility on the 
specific stack members. The stack master sends the message to all stack members.
Switches with different Cisco IOS software versions likely have different stack protocol versions. Switches with different major version numbers are
incompatible and cannot exist in the same switch stack.
Version mismatch- is partial compatible.
The software detects the mismatched software and tries to upgrade (or downgrade) the switch in VM mode with the switch stack image or with a tar file
image from the switch stack flash memory. The software uses the automatic upgrade (auto-upgrade) and the automatic advise (auto-advise) features.
SW# show switch;
W(config)#switch 1 priority 15;
SW#show platform stack manager all;
SW#show switch stack-ports;
SW#show switch stack-ring speed;
_____stackwise_____
____VSS____Virtual Switch System for chassis  ie 4500 6500 8500
ESFU-Enhanced Fast Software Upgrade. Upgrade ios with no downtime
SW1-VSS#show module; to see modules and make sure vss will be compative need same supervisor engine!SW
SW1-VSS#show version; 
create a domain id which can be between 1 and 255
SW1-VSS(config)#switch virtual domain 1;switch 1;
SW2-VSS(config)#switch virtual domain 1;switch 2;
SW1-VSS(config)#switch 1 priority 110;
SW1-VSS(config)#switch 2 priority 100;
SW2-VSS(config)#switch 1 priority 110;
SW2-VSS(config)#switch 2 priority 100;
Use two unqiue port channels because the devices will become one, and you dont want both sides of port-channel same number
also unique virutal link configured on each 
SW1-VSS(config)#int port-channel 1
SW1-VSS(config-if)#no shut
SW1-VSS(config-if)#switch virtual link 1; assigning the domain to the link
SW1-VSS(config-if)#exit
SW1-VSS(config)#int r ten 1/4 - 5
SW1-VSS(config-if)#channel-group 1 mode on
SW1-VSS(config-if)#no shut; as no shut was on port channel all port channel command should propogate to int
------------------
SW2-VSS(config)#int port-channel 2
SW2-VSS(config-if)#no shut
SW2-VSS(config-if)#switch virtual link 2; 
SW2-VSS(config-if)#exit
SW2-VSS(config)#int r ten 1/4 - 5
SW2-VSS(config-if)#channel-group 1 mode on
SW2-VSS(config-if)#no shut;
Now ready to convert the 6500s to VSS
config on both switches will be merged into a single configuration
inteface numbers will be renumbered
SW1-VSS#switch convert mode virtual;
SW2-VSS#switch convert mode virtual
SW1-VSS(config)#hostname SW-VSS;
SW-VSS#
SW-VSS#show switch virtual;
SW-VSS#show switch virtual link;
SW-VSS#show int vsl; 
SW-VSS#show switch virtual role;
___vss_____
____FHRP______
HSRP: Hot stanby routing protocol
Switches typically only allow 16 unique HSRP group numbers although they can be numbered 0-255
HSRP group numbers are locally significant so you could keep using same group number on different vlans say keep reusing 1
or for MHSRP just keep using group 1 and 2 might also help organizing plan.
Default priority is 100 although it can be from 0-255
Election:
Disabled-
Learn-
Listen-
Speak-
Standby- only standby monitors hello by acive R default hellos 3 def hold 10
Active-
If active goes down and there is another router in listen state next highest router becomes standby

SW(config-if)standby 1 timers msec 100 msec 300; alter the hello and hold use keywork msec for millisec
hold should always be atleat 3 times the hello incase packet dropped or any issues.
SW(config-if)#standby 1 preempt [delay minimum seconds] [reload seconds];
reload seconds will require router to wait for this period for routing table to converge necessary for big tables!
Plain text authentification:->SW(config-if)#standby 1 authentification string; plain text not so safe
SW(config-if)#standby 1 authentification md5 key-string [0|7] string;
0 is entering string plaintext choose 7 if entering the hash
(config)#key chain chain-name
SW(config-keychain)#key key-number;
SW(config-keychain-key)#key-string [0 | 7] string; once again hashed or plain
SW(config)# int fa 1/0/1;standby 1 authentification md5 key-chain chain-name;
you can choose any key number but keys are tried in sequential order so you will want key 1 to be active key
SW(config)#standby 1 track int serial 0/0 20; decrements priority 20 when int goes down
you could also use multiple interfaces to decrement and decrement cumulative, also increments when int comes back up
default decrement is 10
SW(config-if)#standby 1 ip 10.2.2.2 secondary; when int has secondary ip HSRP can also have secondary
to use with ipv6 use:
SW(config-if)#stanby version2; standby ipv6 autoconfig;
0000.0c07.ac01- mac address for standby group 1 last two digits represent group # in hex
0000.0c07.ac10- WHICH GROUP IS THIS>???NOT 10!!!!   its hex remember count for hex group 16
SW#show standby vlan 50 brief; will show active standby ip's priority 
SW#show standby vlan 50; will show brief plus timers
VRRP- Virtual Router Redundancy Protocol- IETF standards based RFC 2338
active router is the master router. All other routers are in the backup state.
group number 0-255. priority 1-254
0000.5e00.01xx   where x is the group number based on hex
VRRP advertisements by default are one every second. Backup routers can learn interval from master
by default all VRRP routers have preempt enabled.
VRRP using multicast address of 224.0.0.18 uses ip protocol 112
SW(config-if)#vrrp 1 priority 110;vrrp 1 timers advertise msec 100; vrrp 1 timers learn; learn timer from master
SW(config-if)#no vrrp 1 preempt; preempt must be disabled if that is desired effect due to being on by default
Everything is basically the same except where you would use standby you now use vrrp.
SW#show vrrp brief; basic info same as hsrp ips master backup group addy preempt or not
SW#show vrrp; all the info
GLBP- Gateway Load Balancing Protocol
AVG-one router is elected active virtual gateway, up to four virtual mac addresses can be used in any group
AVF- any router in the group is considered an active virutal forwarder.
GLBP group numbers range from 1 to 1023 and the priority is from 1 to 255 defaulting priority to 100
SW(config-if)glbp 1 preempt [delay minimum seconds];
SW(config-if)#glbp 1 timers msec 100 msec 300; glbp alot like hsrp
hello timer must be greater than hold timer
0007.b4xx.xxyy    yy is virtual forwarder number, xx.xx 16 bit- six 0 bits followed by ten bit group number
SW(config-if)#glbp 1 load-balancing [round-robin | wieghted | host-dependant]
host dependant if you need hosts to receive the same gateway mac
weighted if you want gateway distributed based on weight. and can decrement weights based on interfaces going down
round robin is the default, equal load sharing in sequential order
SW(config)#glbp 2 ip 10.1.1.1 [ secondary]; can create secondary address only AVG gets ip address no other routers
they will all communicate on multicast in subnet.
SW(config-if)#glbp group 3 ipv6 autoconfigure; IPV6 uses fe80::/10 uses /64 fffe injected inbetween mac address
If an AFV fails another router will be given that routers virtual mac until the timeout has expired and the down routers
mac address has been flushed. due to this port security limiting one mac would bring the interfaces down. 
ALL AVFs do not need to be given AVG gateway address but it is a good idea to set it manually.
Like HSRP make sure you configure preempt on routers you want active and also priority
SWA(config-if)#int vlan 10; ip add 192.168.1.20 255.255.255.0;glbp 1 priority 200; glbp 1 ip 192.168.1.1;glby 1 preempt;
SWB(config-if)#int vlan 10;ip add 192.168.1.21 255.255.255.0;glbp 1 priority 150; glbp 1 ip 192.168.1.1; glbp 1 preempt;
SWC(config-if)#int vlan 10;ip add 192.168.1.22 255.255.255.0;                     glbp 1 ip 192.168.1.1;
SW#show glbp brief;
SW#show glbp [group#];
___fhrp___
___PORT-SECURITY___
SW(config-if)#switchport port-security; must be enabled before anything else can be done!
SW(config-if)#switchport port-security maximum [max]; where max is max number of mac on an int
SW(config-if)#switchport port-security mac-address 1111.1111.1111; associate 1111.1111.1111 with the port
SW(config-if)#switchport port-security mac-address sticky; by default macs are stored in ram in cam. Sticky adds it to startup-config
SW(config-if)#switchport port-security violation [shutdown | restrict | protect];
shutdown shuts int, restrict doesn't allow more than configured, protect same as restrict but also sends log and snmp trap
SW#show port-security {all | configured | dynamic | sticky } {address mac-addr | int fa 1/0/1};
SW#show int status err-disable;
802.1x
Windows cleint config->  http://www.cc.iitd.ernet.in/windows-10.pdf
SW(config)#aaa new-model; use method list
SW(config)#radius-server host 10.1.2.210 auth-port 1812 acct-port 1813 key string;
SW(config)#aaa authentification dot1x default group radius
SW(config)#dot1x system-auth-control;enables 802.1X on the switch, by default no auth when global must be on int
SW(config-if)#dot1x port-control {force-authorized | force-unauthorized | auto}; same below just different ios
SW(config-if)#authentication port-control auto; depending on which image you have
debug radius;

auto- port uses 802.1x to move from anauthorized to authorized.
force-authorized- forced to authorize any connected client no auth is necessary, this is also the default state
force-unathorized- never authorize any connected cleint. port cannot move to authorized state
--------What I used for IOS 15---- for radius applied on switch itself-----
(config)aaa new-model	-beware immediately applies local  authentication to all lines and interfaces except line console 0
(config)username jeff priviledge 15 secret mypass	- might want to make habbit or creating user before aaa new-model
(config)radius server SecureLogin
(config-radius-server)address ipv4 10.10.10.254 auth-port 1812 acct-port 1813 key SW1
(config-radius-server)key MyRadiusPass
(config)aaa group server radius MyRadiusGroup
(config-sg-radius)server name SecureLogin
(config)aaa authentification login default group MyradiusGroup local;	- local is the backup local username incase MyradiusGroup goes down
(config)#aaa authentication enable default group myradiusgroup enable;
(config)#aaa authorization exec default group myradiusgroup if-authenticated; radius authorization if user has priv exec access
suceeds if user has authentification. level 15
remember tacacs would be the same config except replace radius with tacacs
----------------------------------------------------------------------------------------
SW#show int fa 1/0/1; shows lots of info
SW#show authentification int fa 1/0/1;
SW#show authentification sessions;
SW#show dot1x [all | summary];
SW#debug authentification all; see auth debug
SW(config)#radius-server vsa send authentication; allow send specific config info in with authentification
SW(config)#aaa authorization network default group radius; needed for dynamic vlan assignment radius server can change vlan 
Switch(config-if)# authentication event fail action authorize vlan 40; vlan for when auth fails
SW(config-if)#authentification host-mode [multihost]; more than once device connected to port hub/SW
multi-auth; multi authent to occur.multi-domain; used for both host device and phone.->single-host; you knon->open; port open no access restriction
SW(config-if)#dot1x pae [ supplicant | authenticator | both]; port access entity
SW#config-if)#dot1x guest-vlan 99; assign a guest vlan ONLY for guest who don't have 802.1x client, if 802.1x fails no access at all
SW(config-if)#dot1x guest-vlan supplicant; not sure why cisco docs user work supplicant
SW#show debug condition; shows your debugging special conditions
SW#no debug int fa 1/0/1; no debug int all; stop special condition debugging
SW#debug condition int fa 1/0/1; keep adding interfaces until you have what you want
SW(config)# identity profile default; creates identity profile and enters dot1x profile config mode
SW(config-identity-prof)# int fa 1/0/1;enter int config mode specifies int for 802.1x authentification
SW(config)#radius-server vsa send authentification; configs NAS to recognize and user vendor specific attributes

Storm Control
storm-control {broadcast | multicast | unicast} level {level low-level | bpg level low-level | pps level low-level}
SW(config-if)#storm-control broadcast 50; drops broadcast frames when they reach above 50 percent of available bandwidth
SW(config-if)#storm-control multicast 30 10; drop multicast frames then the reach above 30 and maintain above 10 percent of avail BW
SW(config-if)#storm-control unicast level pps 50k; drops packets when above 50k packets per second
Unicast is directly referring to unknown unicast not known typicall data unicast
___port-security____
___SecuringVlans____
Book starts off by saying acl can not be applied within an vlan you need a routed port like SVI
Not true, you can place a standard or exteneded acl on an interface blocking traffic from within vlan.
Also you can place mac access-list on interfaces.
ACL placed on an interface is only allowed to be inward if it is layer 2. If you no switchport, acl then can be placed in either direction
VACL-
SW(config)#ip access-list standard 1;deny any; rememeber standard only checks source address, thats y placed nearest dest when applied
SW(config)#vlan access-map blockallusers 10; blockallusers is the name, and 10 is sequence number
SW(config-access-map)#match ip address 1; check these ip addresses, acl was source everyone
SW(config-access-map)#action drop; here you can drop, forward, redirect int fa 1/0/5, your choice
SW(config-access-map)#vlan filter blockallusers vlan-list 2; apply filter using map name and choice of vlans
Private vlans:  vtp mode must be transparent
SW(config)#vlan 10; private-vlan community; communinity can only communicate with its community and primary
SW(config)#vlan 20; private-vlan isolated; isolated can only communicate with primary and know one within isolated
SW(config)#vlan 100; private-vlan primary;private-vlan association 10,20; conf association here!
any community or isolated vlan con communicate with primary
SW(config)#int fa 1/0/1; switchport mode private-vlan host; switchport private-vlan host associated 100 10; primary -secondary
SW(config)#int fa 1/0/2; switchport mode private-vlan host; switchport private-vlan host associated 100 20; primary -secondary
SW(config)#int fa 1/0/3;switchport mode private-vlan promiscuous;switchport private-vlan mapping 100 10,20
Primary gets promiscuous and get mapping instead of associated it maps who can and cant communicate
communication in communit is on local vlan community only isolated no communication in vlan
SW(config)#int vlan 100; private-vlan mapping 10,20; SVI does not need promiscuous.
SW# show vlan private-vlan;
SW#show vlan private-vlan type;
is you create a bogus native vlan and don't allow it on a trunk->CDP,DTP,PAgP will still be sent over trunk on native vlan. Special case
SW(config-if)#switchport native vlan 800; switchport trunk allowed vlan remove 800;
CANT CONTACT SVI: don't let SW(config)#ip routing;  get the best of you. You can set ips without routing enabled
____securingvlans____
___Spoofing_____
SW(config)#ip dhcp spoofing; enabling dhcp globally so it can be configured.
SW(config)#ip dhcp snooping vlan 2,4,5-7; actually enables it to work on the specific vlans
SW(config)#int fa 1/0/1; ip dhcp snooping trust; disables snooping on this int, any uplink to dhcp server should be trusted!
SW(config)#int fa 1/0/3; ip dhcp snooping limit rate 3; rate 3 pps on this interface, for dhcp clients requesting addy
SW#sh ip dhcp snooping [binding];  show you your snooping config or binding addresses
SW(config)#ip source binding mac-address vlan vlan-id ip-address int fa 1/0/5; adds a static binding because static hosts wont be
in the dhcp snooping database that source guard relies on
SW(config)#int fa 1/0/10; ip verify source [port-security]; will verify the correct source info use port security if want mac checked also
prevents spoofing attacks made up mac addresses and made up ip addresses.
SW# sh ip verify source; see the contents
SW#sh ip source binding; to check source binding database, combo of dhcp snooping and static if there is a host using addresses that are
not learned as a switch learns or assigned dhcp snooping or statically the packets will be dropped.
SW(config)#ip arp inspection vlan vlan 4,6,8-11; enable arp inspecion on vlans.
SW(config-if)# ip arp inspection trust; disable arp inspection on int, important for ports to other switches!!!
SW(config)#arp access-list myarplist; permit ip host 10.1.2.210 mac host aaaa.bbbb.cccc; arp uses dhcp snooping binding so you will need
an acl to represent that statically assigned hosts within switch.
SW(config)#ip arp insepction filter myarplist vlan 4,6,8-11 [static]; if used static arp will not use dhcp snooping only the list.
you will likely want both used snooping database for all hosts dhcp and then static for a server or static host for any reason
SW(config)#ip arp inspection validate [ src-mac | dst-mac | ip]; have arp validate packet info with ethernet header or ip header
SW(config)#
___spoofing_____
___AAA____
SW(config)#aaa new-model; enables aaa on device, create username and password locally!!!!
beware immediately applies local authentication to all lines and interfaces except line console 0; so its basically login local;
Note that this command will break non-AAA line and enable passwords. except console
SW(config)#username jeff secret jeffspass; will create a backup incase servers are down
SW(config)#aaa group server radius myradiusgroup;server 10.1.3.1;server 10.1.3.2; assign servers to a perticular group and group name
SW(config)#aaa authentification login [ default | list-name]; default would be no name example below
SW(config)#aaa authentification login mynewlist group myradiusgroup local; create list and then can assign it to something like below
SW(config-line)#login authentification mynewlist; now line vty will use myradiusgroup and then local if fails
SW(config)#aaa authorization [ commands | config-commands | configuration | exec | network | reserse-access] [ default | list-name]
commands: the server must return permission to use any switch command at any privilege level.
config-commands: The server must return permission to use any switch configuration-command.
configuration: The server must return permission to enter switch configuration mode. priviledge exec is config mode
exec: The server must return permission for the user to run a switch Exec session
Network: Ther server must return permission to use network-related services
reverse-access:The server must return permission for the user to access a reverse telnet session
SW(config)#aaa accounting [ system | exec | commands level ]
system: major switch evetns such as reload are recorded
exec: aser authentification into an exec session is recorded, along with information about the users address and time
commnds level: ie commands 15; information about commands at specific level are sent to accounting
start-stop: events recorded when they start and stop
stop-only: events recorded when they stop
none: no events are recorded
SW(config)#aaa acounting exec default start-stop group myradiusgroup;
SW(config)#aaa accounting commands 15 default start-stop group myradiusgroup;
___aaa___
