";" will represent stacking commands as if shell is enabled
___Basics____
int fa 1/0/1; means interface type stack-member/module/portnumber- you will usually only see modules with routers.
creating a macro for lots of configurations-
config)#define interface-range MymacroName fa 1/0/1 - 4 , fa 2/0/3 - 7, g 3/0/1 , g 3/0/2
config)#int r macro MymacroName;  book says always use spaces with hyphens and commas
___basics____
___Errdisable____
By default a catalyst switch detects an error condition one every port for every cause.
Error is detected switch is put into errdisable. Tune behavior from glocal configuration.
config)#no errdisable detect cause [all | cause-name]; remove all errdisable or a specific one by name
You can automatically recover from errdisable.
config)#errdisable recovery cause [ all | cause-name]; default is 300 seconds to bring port up
config)#errdisable recovery interval seconds; seconds should be actual seconds not typed word
___errdisable____
____CDP---LLDP_____
config)# do show cdp neighbors [type member/module/portnum]; can show all or specific so last part not needed
config)#do show cdp neigh detail- lots of info including ip can also be used with aboce commands
config)# no cdp run; turn off cdp----->config)#cdp run; turns it back on
config-if)#no cdp enable;---->config-if)cdp enable; cdp on or off on interface, security reasons!
LLDP- Link Layer Discovery Protocol - 802.ab IEEE standard can be used with linux servers and many other devices
SW#show lldp; find out if its running or not
config)# lldp run;--->config)#no lldp run; turns lldp on or off
config)# do sh lldp neighbors; once again have the options to set specific interface or details for granularity
config-if)#no lldp [receive | transmit] once enabled globally works on every port use int commands for granularity
____cdp---lldp____
____POE---UPOE____
Switch detects weather a powered device is connected to port. If it is switch provides power. Sends out small power, and
sees if there is a device drawing power. BAsically just does a test for draw.
default class 0 is used if switch or powered device does not support or does not attempt optional power class discovery
class 0 15.4W, class 1 4.0W, class 2 7.0W, class 3 15.4 W, class 4 30W.
by default switch offers maximum of 15.4W per port. IF device needs additional power is can tell switch with CDP-LLDP
config-if)#power inline [ auto | static] max maxmilliwatts; everything is in milla so 15.4 W is 15400
config-if)power inline never; disable poe on a switch port
SW#sh power inline; displays switch ports and their current states
use cases? Typically phones or security cameras.
SW#sh power inline g 1/0/19; detail is optional if you want lots of data
___poe---upoe____
____EXTRA-LIGHT-ON-TOPICS___
Why does cdp work with misconfigured native vlan and what is happening.
Switch A native vlan 3, Switch B native vlan 6. Device traffic uses the native vlan and native vlan is untagged so
basically switch a non tagged vlan traffic can hop on over to switch B vlan 6 which is also non tagged across trunk
Basically you don't want traffic hopping vlans at layer 2, thats what inter vlan routing is for. Don't be suprised if you get
inconsistent behavior one day I could jump vlans next day Spantree-blocked vlan 2&3 no communication, fixed native vlan
%SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking FastEthernet1/0/48 on VLAN0002. Port consistency restored. so its iffy
VTP domain mismatch will not allow trunks to come up through negotiation, or if static trunk, trunk will
come up but vtp information will not be propogated.
____extra-light-on-topics___
____CAM_____ Content Addresable Memory  - mac address-table layer 2 movements
show mac address-table; you can use many switches [dynamic, static, vlan, int]
show mac address-table count; display current cam table length
mac address-table static mac-address vlan vlan-id int fa 1/0/48; add a stiatic address in the cam table
clear mac address-table dynamic mac-address int fa 1/0/48 vlan vlan-id; remove a specific entry in cam
to change the size of the mac address table you need to use sdm
____cam____
____TCAM_____ Ternary Content-Addressable Memory -  Ternary just stands for 3 -VMR
two tcams one for ACL and one for Qos ACL
show platform tcam utilization;
show tcam counts; monitor utilization of tcam and lous
show platform hardware capacity acl;
show tcam lou;
Value-134 bit and holds--->protocol,Tos, source, src port, s port lou, dest, dest port,d port lou
Mask-
Result- permit or deny
each mask has a dest mask and source and for that pairing there can be 8 entries in that section
LOU- logical operation unit- lt-less than, gt-greater than, eq-equal to, neg-not equal to, range
if you run out of lou space done in hardware you can expand this to be done in software
It is NOT correct to directly correlate number of ACEs configured to number of masks/entries used.
As you might be aware, an ACL and the TCAM are order dependent. For 2 ACEs to share the same mask
besides having the donâ€™t care bits in the same locations they need to be adjacent to each other in the ACL definition.
Example:
permit any host 192.168.10.0;permit any host 192.168.10.1;- this can be represented by one tcam entry
Permit 192.10.10.0 255.255.255.254
Defining logical operations in ACL to optimize usage of TCAM/LOUs
if you run out of lou you should just state specifics lets say we want Permit any host 192.10.10.1 tcp range 1020 1023 any 
and we can not use more hardware lous then we
Permit any host 192.10.10.1 tcp 1020 any; Permit any host 192.10.10.1 tcp 1021 any; Permit any host 192.10.10.1 tcp 1022 any; Permit any host 192.10.10.1 tcp 1023 any
attempt to reuse lous already created for other ACE when possible
https://supportforums.cisco.com/t5/network-infrastructure-documents/acl-tcam-and-lous-in-catalyst-6500/ta-p/3115339
_____tcam_____
____SDM_____ - Switching Database Manager  manages partition sizes for efficient switching
show sdm prefer
sdm prefer tempplate; template will be of your choosing ie default,access,vlan,routing 
sizes are much smaller while dual stacking ipv4 and ipv6
If your switch does not have ipv6 commands change the sdm template to ipv4-ipv6 dual stack
___sdm____
____FREERADIUS_____
http://wiki.freeradius.org/guide/SQL-HOWTO-for-freeradius-3.x-on-Debian-Ubuntu
___freeradius____
____TACACS+_____
http://www.ebrahma.com/2015/06/configuring-mysql-aaa-authentication-and-accounting-with-tacacs-on-linux/
possibly promising based on the date
____tacacs+______
